In [6]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [14]:
data= pd.read_csv('/Users/shijie/Desktop/python_basic_da/02-Pandas/imdb.csv')
data.head()

   Unnamed: 0                    movie_title         director_name  imdb_score
0        2765  Towering Inferno                     John Blanchard         9.5
1        1937      The Shawshank Redemption         Frank Darabont         9.3
2        3466                 The Godfather   Francis Ford Coppola         9.2
3        4409          Kickboxer: Vengeance         John Stockwell         9.1
4        2824           Dekalog                                NaN         9.1

In [16]:
data.head()[["movie_title","director_name"]]

                     movie_title         director_name
0  Towering Inferno                     John Blanchard
1      The Shawshank Redemption         Frank Darabont
2                 The Godfather   Francis Ford Coppola
3          Kickboxer: Vengeance         John Stockwell
4           Dekalog                                NaN

In [19]:
data.sort_values("imdb_score",ascending=False)

,Unnamed: 0,movie_title,director_name,imdb_score
0,2765,Towering Inferno,John Blanchard,9.5
1,1937,The Shawshank Redemption,Frank Darabont,9.3
2,3466,The Godfather,Francis Ford Coppola,9.2
3,4409,Kickboxer: Vengeance,John Stockwell,9.1
4,2824,Dekalog,NaN,9.1
...,...,...,...,...
5038,2268,Disaster Movie,Jason Friedberg,1.9
5039,2295,Superbabies: Baby Geniuses 2,Bob Clark,1.9
5040,4605,The Helix... Loaded,A. Raven Cruz,1.9
5041,1136,Foodfight!,Lawrence Kasanoff,1.7
5042,2834,Justin Bieber: Never Say Never,Jon M. Chu,1.6

In [22]:
df1 = DataFrame(np.arange(9).reshape(3,3), index=['BJ','SH','GZ'], columns=['A','B','C'])
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [24]:
df1.index

Index(['BJ', 'SH', 'GZ'], dtype='object')

In [29]:
df1.index=Series(['bj','sh','gz'])
df1

    A  B  C
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [34]:
df1.index=df1.index.map(str.upper)
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [37]:
df1.rename(index=str.lower,columns=str.lower)

    a  b  c
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [39]:
df1.rename(index={'BJ':'beijing'},columns={'A':'a'})

         a  B  C
beijing  0  1  2
SH       3  4  5
GZ       6  7  8

In [40]:
list1 = [1,2,3,4]
list2 = ['1','2','3','4']

In [42]:
[str(x) for x in list1]

['1', '2', '3', '4']

In [48]:
list(map(str,list1))

['1', '2', '3', '4']

In [47]:
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [50]:
def test_map(x):
    return x + '_ABC'

In [52]:
df1.index.map(test_map)

Index(['BJ_ABC', 'SH_ABC', 'GZ_ABC'], dtype='object')

In [53]:
df1.rename(index=test_map)

        A  B  C
BJ_ABC  0  1  2
SH_ABC  3  4  5
GZ_ABC  6  7  8